class PlanetInfo {
  final String name;
  final String iconImage;
  final String description;
 

  PlanetInfo(
     {
    required this.name,
    required this.iconImage,
    required this.description,
  });
}

List<PlanetInfo> planets = [
  PlanetInfo(
    name: 'Меркурий',
    iconImage: 'assets/mercury.png',
    description:
        "От всички планети в Слънчевата система Меркурий e най-близо до Слънцето.Меркурий e една от най-малките планети в Слънчевата система.Нейният диаметър - 4878km, e почти три пъти по-малък от земния.Единствено Плутон e по-малък от нея.Масата на планетата e 20 пъти по-малка от тази на Земята.Планетата неслучайно носи името на бързоногия вестител на олимпийските богове Хермес (в римската митология - Меркурий). Това e най-бързо движещата ce планета в Слънчевата система.",
   
  ),
  PlanetInfo(
    name: 'Венера',
    iconImage: 'assets/venus.png',
    description:
        "Венера е описвана често като планетата сестра на Земята. Двете си приличат по размер, плътност и химичен състав. При формирането си са били почти неразличими една от друга.Днес, обаче те са толкова различни, колкото две планети могат да бъдат. Докато Земята е свят, където кипи живот, Венера е необитаем ад с плътна, гореща атмосфера, където липсват каквито и да е следи от кислород или вода.",
  
  ),
  PlanetInfo(
    name: 'Земята',
    iconImage: 'assets/earth.png',
    description:
        "Нашата планета Земя, е третата планета в Слънчевата система и има доста и интересни характеристики. За разлика от имената на останалите планети, кръстени на богове от римската или гръцката митология, Земята е получила името си преди поне 1000 години,като резултат на културните разбирания на хората.Трябва да се отбележи, че всеки език си има негово име за планетата – например „Еarth“ на английски, „Тerra“ на португалски, „Аarde“ на холандски.Общото между наименованието й на всички езици е, че значението е почти едно и също – земя или почва.",
   
  ),
  PlanetInfo(
    name: 'Марс',
    iconImage: 'assets/mars.png',
    description:
        "Марс носи името на римският бог на войната, е и свят, който вълнува все повече хора. Някога там е имало течаща вода, но днес Червената планета – както е познат Марс – е студен, сух свят, а повърхността му е набраздена от каньони и отдавна угаснали вулкани.",
   
  ),
  PlanetInfo(
      name: 'Юпитер',
      iconImage: 'assets/jupiter.png',
      description:
          "Юпитер е петата поред планета от Слънцето и носи името на най-могъщият бог от римския пантеон. Той е и най-големият от всички планети в системата ни. Третият най-ярък обект в нощното небе (след Луната и Венера), той е и доста лесен за наблюдение и изследване.",
      ),
  PlanetInfo(
    name: 'Сатурн',
    iconImage: 'assets/saturn.png',
    description:
        "Бледият, жълтеникав Сатурн, е различава доста от останалите външни планети с великолепните пръстени, които опасват екватора му. Носи името на един могъщ бог от римския пантеон, баща на Юпитер, той е шестата планета от Слънцето. Пръстените на Сатурн – може би най-разпознаваемата характеристика на планетата. Различаваме общо седем пръстена – всеки от тях носи име на буква от A до F, в зависимост от реда на откриването им. Разстоянията между пръстените, носят имената на астрономите които са ги открили. Общата структура на пръстените е от ледени късове с различна големина – ледът отразява слънчевата светлина и кара самите пръстени да блестят.",
    
  ),
  PlanetInfo(
    name: 'Уран',
    iconImage: 'assets/uranus.png',
    description:
        "Уран е син, привидно скучен свят, който има система от пръстени и цяло семейство луни. Незабележимият му, на пръв поглед, външен вид обаче е измамен. Оста му на въртене е наклонена на 98 ˚, което, погледнато от Земята, изглежда, като да го кара да се върти на една страна. Същият този ефект се предава и на системата му от пръстени и луни, които, също привидно за наблюдател от Земята, изглеждат, като че ли обикалят около него „отгоре надолу“. На всяко завъртане около Слънцето, северният и южният му полюс преживяват 42-годишно постоянно греене и 42 години пълна тъмнина. Това от своя страна води до доста дълги и контрастни сезони.",
   
  ),
  PlanetInfo(
    name: 'Нептун',
    iconImage: 'assets/neptune.png',
    description:
        "Нептун е най-отдалечената от Слънцето планета. Температурата на повърхността му достига вледеняващите -201 ˚C! Оста му на въртене е наклонена на 28,3 ˚, което обособява и сезони – с тази разлика, че на Нептун те траят по около 40 години.",
   
  ),
];
